// قائمة المهارات الـ65 موزعة حسب المجموعات العمرية
const skillGroups = [
  {
    label: "العمر 0:0-0:2",
    items: [
      {
        number: 1,
        text: "وجود منعكس المص والبلع",
        instruction: "زجاجة رضاعة بحلمة أو لهاية يقدّمها المُعتني\nالتقييم : يُظهر تسلسلاً منسقًا بين المصّ والبلع؛ دون سعال أو اختناق أو سكب"
      },
      {
        number: 2,
        text: "يُصدر أصواتًا من الحنجرة",
        instruction: "ضع الطفل مستلقياً على ظهره وتحدث إليه.\nالتقييم : يُصدر أصواتًا رخوة، حنجريّة، غَرغَرية"
      },
      {
        number: 3,
        text: "يُغيّر نغمة أو مدة أو شدة البكاء",
        instruction: "هل يبكي طفلك أحيانًا بقوة وأحيانًا برقة؟\nالتقييم : يُصدر أصواتًا أو يبكي مع تنوّع في النغمة أو المدة أو الشدة"
      },
    ]
  },
  {
    label: "العمر 0:3-0:5",
    items: [
      {
        number: 4,
        text: "يستجيب للمتحدث بالابتسام",
        instruction: "هل يبتسم طفلك للأشخاص عندما يتحدثون إليه؟\nالتقييم : يبتسم استجابةً لاقتراب المتحدث منه أو حمله أو التحدث إليه"
      },
      {
        number: 5,
        text: "يُصدر أصواتًا تُعبّر عن المتعة والانزعاج",
        instruction: "هل يصدر طفلك أصواتًا عندما يكون سعيدًا \nومرتاحًا تختلف عن الأصوات التي يصدرها عندما يكون متعبًا أو منزعجًا أو غير سعيد؟\nالتقييم : يُصدر صوتين صحيحين (واحد للتعبير عن المتعة وآخر للتعبير عن الانزعاج)"
      },
      {
        number: 6,
        text: "يُصدر أصواتًا عند التحدث إليه، مع تحريك الذراعين والساقين أثناء إصدار الأصوات",
        instruction: "هل يصدر طفلك أصواتًا ويحرك ذراعيه ورجليه عندما يتحدث إليه أحدهم؟\nالتقييم :  تُرافق الأصوات حركات لا إرادية مثل خفق الذراعين أو تحريك الساقين"
      },
    ]
  },
  {
    label: "العمر 0:6-0:8",
    items: [
      {
        number: 7,
        text: "يضع الأشياء في فمه",
        instruction: "يُعبّر عن الرفض بالإشارة أو الصوت\nأمثلة على سلوكيات الاعتراض\nالتمدد نحو الشيء، دفع الشخص بعيدًا، هز الرأس بمعنى لا\nتحريك الرأس أو الجسم بعيدًا عن الوصي، الإمساك باللعبة بإحكام،البكاء\nالتقييم : يظهر الطفل سلوك اعتراض واحد على الأقل أو يصدر صوت اعتراض"
      },
      {
        number: 8,
        text: "يُحاول تقليد تعبيرات الوجه والحركات",
        instruction: "هل يحرك طفلك شفتيه أو لسانه عندما تصنع وجوهًا مضحكة أو تحرك شفتيك ولسانك؟\nالتقييم: يُحاول تحريك وجهه أو لسانه استجابةً لتعبيرات وحركات وجه المُعتني."
      },
      {
        number: 9,
        text: "يُصدر صوتين مختلفين من أصوات الصوامت",
        instruction: "هل يصدر طفلك أصواتًا مختلفة مثل /ب/ و /م/؟\nالتقييم: يُنتج صوتين مختلفين واضحين من أصوات الصامتة."
      },
      {
        number: 10,
        text: "يُصدر صوتين مختلفين من أصوات الصوائت",
        instruction: "هل يصدر طفلك أصواتًا مختلفة مثل /ا/ و /و/؟\nالتقييم: يُنتج صوتين مختلفين واضحين من أصوات الصوائت."
      },  
    ]
  },
  {
    label: "0:11-0:9 العمر",
    items: [
      {
        number: 11,
        text: "يدمج بين الأصوات",
        instruction: "هل يصدر طفلك صوتين معًا، مثل \"با\" أو \"با\"؟\nالتقييم: يُصدر تركيبة صوتية أو مقطعًا لفظيًا (V-V, C-V, or V-C)\nأمثلة على استجابات صحيحة:\n- متحرك-متحرك (V-V): آه-إي، أو-أوه\n- حرف ساكن-حرف متحرك (C-V): با، ما، دا، دو، تي\n- حرف متحرك-حرف ساكن (V-C): آخ، أب، أم\nأمثلة على استجابات غير صحيحة:\n- تكرار الحروف الساكنة فقط: ب-ب-ب-ب (مثل إصدار صوت فرقعة الشفاه)\n- إطالة الصوت المتحرك: آآآآآه\n- إطالة الصوت الساكن: م-م-م-م"
      },
      {
        number: 12,
        text: "يسعى لجذب انتباه الآخرين",
        instruction: "هل يحاول طفلك لفت انتباهك؟\nالتقييم: الطفل يبذل جهدًا لجذب أو الحفاظ على الانتباه."
      },
      {
        number: 13,
        text: "يلعب ألعابًا بسيطة مع شخص آخر مع استخدام التواصل البصري المناسب",
        instruction: "شارك الطفل في نشاط لعب تفاعلي مثل وضع الأشياء داخل الصندوق وخارجه\nالتقييم: يشارك في اللعب مع شخص آخر مع الحفاظ على التواصل البصري المناسب\nأمثلة على استجابات صحيحة:\n- الطفل يلعب (peek-a-boo) مع استخدام التواصل البصري المناسب."
      }
    ]
  },
  {
    label: "1:5-1:0 العمر",
    items: [
      {
        number: 14,
        text: "يستخدم إيماءة تمثيلية (رمزية)",
        instruction: "هل يلوح طفلك بيده ليقول وداعًا (باي-باي)؟\nهل يصفق طفلك بيديه ليُظهر أنه سعيد أو فخور بشيء فعله، مثل رمي الكرة؟\nالتقييم: يستخدم إيماءة رمزية واحدة.\n(مثال: يلوّح للوداع، يصفق، يحرك جسده)"
      },
      {
        number: 15,
        text: "يُصدر الطفل مقاطع صوتية مكونة من مقطعين",
        instruction: "العب مع الطفل لاستثارة إنتاج تركيبات مكونة من مقطعين.\nإذا أظهر الطفل اهتمامًا بالفقاعات، انفخ الفقاعات.\nقل تراكيب من مقطعين مع انفجار كل فقاعة.\nالتقييم:\nيُصدر مقطعًا مكونًا من مقطعين (مثل: ماما، بابا)."
      },
      {
        number: 16,
        text: "يتبادل الأدوار الصوتية عدة مرات",
        instruction: "عندما تقلد صوتًا يصدره طفلك، هل يعيد الطفل الصوت الذي قمت به؟\nهل يتبادل معك الأدوار صوتيًا مرتين أو ثلاث مرات؟\n\nالتقييم:\nيأخذ الطفل على الأقل دورتين للتواصل الصوتي ردًا على تقليد الوصي لأصوات الطفل."
      },
      {
        number: 17,
        text: "يُنتج سلاسل صوتية (مقطعين إلى ثلاثة) بإيقاع يشبه كلام الكبار",
        instruction: "المواد: ألعاب وأشياء أبدى الطفل اهتمامًا بها مسبقًا\nالتقييم: يُنتج سلسلة مكونة من مقطعين إلى ثلاثة مقاطع بصوتية وإيقاع مشابه لكلام الكبار\nحرف ساكن - حرف متحرك (C-V) (لا)\nحرف ساكن - حرف متحرك - حرف ساكن (C-V-C) (مين)\nحرف ساكن - حرف متحرك - حرف ساكن - حرف متحرك (C-V-C-V) (بابا)\nأنواع أخرى"
      },
      {
        number: 18,
        text: "يُصدر خمس آصوات مختلفين من الاصوات الصامتة (?  b d m n )",
        instruction: "التقييم: يصدر الطفل خمس أصوات ساكنة مختلفة"
      },
      {
        number: 19,
        text: "يستخدم كلمة واحدة على الأقل",
        instruction: "المواد:\nألعاب وأشياء أبدى الطفل اهتمامًا بها مسبقًا.\n\nالتقييم:\nيُظهر استخدامًا ذا معنى لكلمة واحدة.\nلكي تُعتبر الكلمة ذات معنى، يجب أن تُستخدم تركيبة الصوت ككلمة بشكل متكرر.\nويجب أن تكون في سياق تواصلي مناسب.\nلا يشترط أن يكون النطق دقيقًا أو مطابقًا للكلمة."
      }
    ]
  },
  {
    label: "العمر 1:6-1:11",
    items: [
      {
        number: 20,
        text: "يستخدم الإيماءات والصوتيات لطلب الأشياء",
        instruction: "ضع اثنين أو ثلاثة أشياء بالقرب من الطفل ولكن بعيدًا عن متناوله.\nقل: \"انظر إلى هذه الأشياء\".\nراقب الطفل لترى إذا كان يشير إلى الشيء أو يحاول الوصول إليه ويصدر صوتًا لطلبه.\n\nالتقييم:\nيُظهر حالة يستخدم فيها الإيماءة والصوت لطلب شيء.\n\nأمثلة على الإجابات غير الصحيحة:\n- الطفل يشير أو يستخدم إيماءة بدون أصوات.\n- الطفل يصدر أصواتًا (مثل البكاء) بدون أن يشير أو يستخدم إيماءة لما يريد.\n- الطفل يصل إلى الشيء ويصدر صوتًا."
      },
      {
        number: 21,
        text: "يُشارك في نشاط لعب روتيني مع شخص آخر لمدة دقيقة واحدة على الأقل، مع الحفاظ على تواصل بصري مناسب",
        instruction: "المواد:\nساعة توقيت أو ساعة عقارب.\n\nالتقييم:\nيُشارك بانتباه ويحافظ على تواصل بصري لمدة دقيقة واحدة."
      },
      {
        number: 22,
        text: "يمد اللعبة أو يشير إلى شيء ليُظهره للآخرين",
        instruction: "هل يشير طفلك إلى الألعاب أو الأشياء الأخرى ليُظهرها لك؟\n\nضع الأشياء في متناول الطفل.\nاطلب من الوصي أن يُظهر للطفل أحد الأشياء.\nراقب إذا كان الطفل يشير إلى شيء آخر أو يُعطي شيئًا للوصي كما لو كان يُريه إياه.\n\nالتقييم:\nيجذب الطفل الانتباه إلى شيء ما عن طريق الإشارة أو العرض."
      },
      {
        number: 23,
        text: "يستخدم خمس كلمات على الأقل",
        instruction: "أثناء اللعب مع الطفل، أشر إلى الأشياء واسأله: \"ما هذا؟\"\n\nالكلمات التي نطقها الطفل:\n\nالتقييم:\nيُنتج خمس كلمات أو أكثر."
      }
    ]
  },
  {
    label: "العمر 2:0-2:5",
    items: [
      {
        number: 24,
        text: "يبدأ بلعبة تبادل الأدوار أو روتين اجتماعي",
        instruction: "اسأل الوصي إذا كان الطفل يلعب لعبة أو لديه روتين لعب باستخدام كرة، بطانية، أو دبدوب في المنزل.\n\nإذا كان الأمر كذلك، اطلب من الوصي اختيار واحدة وبدء اللعب بها.\n\nالتقييم:\nوجود مثال واحد على نشاط يبدأه الطفل معك أو مع الوصي أو شخص آخر."
      },
      {
        number: 25,
        text: "يستخدم الكلمات لأداء وظائف برغماتية متعددة",
        instruction: "ضع وجبة خفيفة مقدمة من الوصي أو لعبة صغيرة داخل كيس بلاستيكي شفاف وأغلقه.\nقدم الكيس للطفل وانتظر لترى ما إذا كان يستخدم الكلمات ليطلب منك فتح الكيس.\n\nاختياريًا، قم بتشغيل لعبة اللف، وعندما تتوقف.\nانتظر لترى ما إذا كان الطفل يستخدم الكلمات ليطلب منك إعادة لف اللعبة.\n\nأمثلة على الوظائف البرغماتية:\n a. يطلب أفعالًا أو أشياء: \"أعطني\"\n b. يذكر أسماء أشياء أو أفعال: \"كرة\"\n c. يطلب التكرار: \"مزيد\"\n d. يطلب المساعدة: \"ساعدني\"\n e. يجيب عن أسئلة بنعم/لا: يهز رأسه بـ\"لا\" أو يومئ بـ\"نعم\"\n f. يستخدم كلمة لجذب الانتباه: \"ماما!\"\n\nالتقييم:\nيستخدم الكلمات للتعبير عن خمس وظائف برغماتية مختلفة."
      }
    ]
  },
  {
  label: "العمر 2:6-2:11",
    items: [
      {
        number: 26,
        text: "يستخدم الكلمات أكثر من الإيماءات للتواصل",
        instruction: "سؤال مراقبة:\nعندما يرغب طفلك في شيء ما، كيف يعبر عن ذلك؟ هل يستخدم الكلمات أكثر من الإشارات مثل الإشارة، محاولة الوصول إلى الشيء، أو سحب الملابس؟\n\nخيارات الإجابة:\na. لا يستخدم لا كلمات ولا إيماءات\nb. يستخدم الإيماءات فقط\nc. يستخدم الإيماءات أكثر من الكلمات في التواصل\nd. يستخدم الإيماءات والكلمات بنفس المعدل\ne. يستخدم الكلمات أكثر من الإيماءات في التواصل\n\nالتقييم:\nيستخدم الكلمات أكثر من الإيماءات في التواصل (اختيار e)"
      },
      {
        number: 27,
        text: "يُسمي أشياء في الصور",
        instruction: "أشر إلى كل صورة وقل: \"انظر إلى هذه الصورة. ما هذا؟\"\n\nأمثلة الصور:\na. كرة\nb. طفل\nc. طائر\nd. حذاء\ne. كلب\nf. بالون\ng. ملعقة\nh. تفاحة\ni. قطة\n\nالتقييم:\nيُسمي خمس صور بشكل صحيح\n\nملاحظة:\nلا تُحاسب الطفل على النطق غير المكتمل أو غير الناضج.\nالكلمة تُعتبر صحيحة إذا أكد الوصي أنها الكلمة المعتادة التي يستخدمها الطفل للإشارة إلى الشيء \n(مثلًا: \"مياو\" للقطة، \"غو غو\" للكلب)."
      }
    ]
  },
  {
  label: "العمر 3:0 - 3:5",
    items: [
      {
        number: 28,
        text: "يستخدم تراكيب لفظية مختلفة",
        instruction: "التراكيب اللفظية التي ينتجها الطفل:\na. اسم/ضمير + فعل (مثل: \"أنا آكل\")\nb. فعل + اسم/ضمير (مثل: \"آكل تفاحة\")\nc. اسم/ضمير + فعل + مكان (مثل: \"ماما بدي باي\")\nd. اسم/ضمير + فعل + صفة (مثل: \"بدي طابة حمرا\")\ne. تراكيب أخرى (مثل: اسم + اسم، ملكية + اسم، مثل: \"هذا لي\")\n\nالتقييم:\nيُنتج الطفل ثلاث تراكيب لفظية مختلفة"
      },
      {
        number: 29,
        text: "يكوّن تراكيب لغوية من ثلاثة أو أربعة كلمات في الكلام التلقائي",
        instruction: "قدّم للطفل عدة ألعاب وأشياء وضعها أمامه وشجّعه على اللعب.\nخلال اللعب، تحدّث مع الطفل ودوّن تراكيبه التلقائية.\n\nأمثلة على إجابات صحيحة:\n• أين هو الجرو؟\n• مامي تذهب\n• أعطني الدب\n• ماذا تفعل؟\n• أين أخي؟\n• لا أحب العصير\n\nالتقييم:\nيُكوّن الطفل تركيبًا لغويًا مكوّنًا من ثلاث أو أربع كلمات"
      },
      {
        number: 30,
        text: "يستخدم صيغة فعل المضارع",
        instruction: "الصفحة: ——\n\nتدريب:\n• بنت تلعب\n• بنت تأكل\n• ولد يأكل\n• بنت تشرب\n\nالتقييم:\nإجابتان صحيحتان"
      }
    ]
  },
  
  {
    label: "العمر 3:6 - 3:11",
    items: [
      {
        number: 31,
        text: "يستخدم صيغة جمع",
        instruction: "التعليمات:\nالتدريب:\n• تفاحات\n• سيارات\n• طابات\n• بالونات\n• شجرات\n• سمكات\n• طيارات\n\nالتقييم:\nأربع إجابات صحيحة"
      },
      {
        number: 32,
        text: "يستخدم صيغة جمع تكسير",
        instruction: "التدريب:\n• قطط\n• كلاب\n• أصابع\n• موز\n• ألوان\n• عيون\n\nالتقييم:\nأربع إجابات صحيحة"
      },
      {
        number: 33,
        text: "يستخدم أدوات الملكية",
        instruction: "التدريب:\n هي موزة الولد → هي موزتو\n هي موزة البنت → هي موزتها\n• طابتها / طابتو\n• طعامها / طعامو\n• كلبو / كلبها\n• قطتها \\n\nالتقييم:\nثلاث إجابات صحيحة"
      },
      {
        number: 34,
        text: "يصف كيفية استخدام الشيء",
        instruction: "التعليمات:\nتمرين: انظر إلى هذه الصورة. هذا قلم رصاص. ماذا تفعل بالقلم الرصاص؟ (تكتب به، ترسم به)\n\nأمثلة إضافية:\n• فرشاية\n• ملعقة\n• سكين\n• منشفة\n• جرابات\n• طنجرة\n\nالتقييم:\nأربع إجابات صحيحة"
      }
    ]
  },
  {
    label: "العمر 4:0-4:5",
    items: [
      {
        number: 35,
        text: "ينتج صيغة المثنى",
        instruction: "التعليمات:\nتمرين: ساعد الطفل على التمييز بين المفرد والمثنى.  قلم – قلمين:\n\n• سيارتين\n• تفاحتين\n• بابين\n\nالتقييم:\nإجابتين صحيحة"
      },
      {
        number: 36,
        text: "يجيب عن الأسئلة بمنطق",
        instruction: "التعليمات:\nتمرين: ماذا تفعل عندما تشعر بالجوع؟ (تأكل)\nماذا تفعل إذا كانت يداك متسختين؟ (أغسلهما)\nماذا تفعل عندما تشعر بالبرد؟ (ألبس)\nماذا تفعل عندما تشعر بالتعب؟ (أنام)\n\nاستخدم التلميحات عند الحاجة في التمرين فقط.\n\nالتقييم:\nإجابتان صحيحتان"
      },
      {
        number: 37,
        text: "ينتج توافق الجنس",
        instruction: "التعليمات:\nاسم مع فعل (ولد يأكل / بنت تأكل)\nاسم مع صفة (ولد طويل / بنت طويلة)، صفة لون (قلم أحمر / وردة صفراء)\nاسم إشارة مع اسم (هذا ولد / هذه بنت)\n\nمجموعة 1:\nولد يشرب / بنت (تشرب)\nولد (يلعب) / بنت تلعب\nولد يكتب / بنت (تكتب)\nولد (يمشط) / بنت تمشط\n\nمجموعة 2:\nفيل كبير / فأرة صغيرة\nدجاجة كبيرة / صوص (صغير)\nزرافة طويلة / ولد (قصير)\nزرافة طويلة / بنت (قصيرة)\nعصفور أحمر / سيارة (حمراء)\nفليفلة صفراء / باص (أصفر)\n\nمجموعة 3:\nهذا ولد / هذه بنت\nهذا ديك / (هذه) دجاجة\nهذا ثور / (هذه) بقرة\n(هذا) باص / هذه سيارة\n\nالتقييم:  ثلاث إجابات صحيحية في كل بند"
      },
      {
        number: 38,
        text: "ينتج توافق العدد مع الاسم",
        instruction: "التعليمات:\nعدد مع اسم إشارة:\n- هذه ولد / هدول أولاد\n- هذه بنت / هدول بنات\n\nعدد مع جمع:\n- بالون واحد / خمس بالونات\n- سمكة وحدة / ثلاث سمكات\n\nالتقييم:\nإجابة واحدة صحيحة لكل بند"
      }
    ]
  },
    {
    label: "العمر 4:6-4:11",
    items: [
      {
        number: 39,
        text: "يجيب عن أسئلة ماذا، أين، ومتى",
        instruction: "التعليمات:\n- شو عم يعمل الولد؟\n- وين الولاد؟\n- ايمت نام/فاق الولد؟\nالتقييم: ثلاث إجابات صحيحة\n\nقل: الآن أريدك أن تجيبني على بعض الأسئلة الأخرى:\n- ماذا أكلت في الإفطار؟\n- أين أكلت الإفطار؟\n- متى تنظف أسنانك؟\n- متى تذهب إلى النوم؟\nالتقييم: ثلاث إجابات صحيحة"
      },
      {
        number: 40,
        text: "يستخدم أشكال الماضي",
        instruction: "التعليمات:\nتمرين: ولد يغسل / ولد غسل وخلص\n- غسلت\n- لبس\n- لبست\n\nالتقييم: إجابتان صحيحتان\n\nملاحظة: لا تعاقب إذا استخدم الطفل فعلًا غير الفعل المستهدف طالما أن زمن الفعل صحيح والمنطوق معقول."
      },
      {
        number: 41,
        text: "يكمل المقارنة والمشابهة",
        instruction: "التعليمات:\nتمرين: أرني يدك. انتظر حتى يفعل الطفل ذلك، ثم ضع يدك بجانب يد الطفل.\nقل: يدي كبيرة. يدك... (صغيرة)\n\n- أجلس على الكرسي؛ أنام في...\n- الخبز للأكل؛ الحليب لـ...\n- النملة صغيرة؛ الفيل...\n- التلج بارد؛ النار...\n- الليل مظلم؛ النهار...\n- السمك يسبح؛ الطائر...\n- الأسد قوي؛ الفأر...\n- الليمون حامض؛ السكر...\n- السيارة سريعة؛ السلحفاة...\n- الصيف حار؛ الشتاء...\n\nالتقييم: ثماني إجابات صحيحة"
      }
    ]
  },
  {
    label: "العمر 5:0-5:11",
    items: [
      {
        number: 42,
        text: "يسمي حسب الوصف",
        instruction: "التعليمات:\nتمرين: ما هو الحيوان الذي يطارد الفئران وله شوارب؟ يصدر صوت مواء. (قط)\n\n- ما هي اللعبة الدائرية التي ترتد؟ تستخدمها للرمي والقبض عليها.\n- ماذا تستخدم عندما تنتهي من الاستحمام أو تخرج من الدش؟ تستخدمه لتجفيف نفسك.\n- ماذا تستخدم عندما تريد أن ترسم شيئًا؟ تأتي في علبة.\n\nالتقييم: إجابتان صحيحتان\n\nإضافي:\n- ما هو الشيء الذي يضيء في الليل ويراه الناس من بعيد؟\n- ما هو الشيء الذي تلبسه في قدميك عندما تخرج من المنزل؟\n- ما هو الشيء الذي تستخدمه لتقطيع الخيار والبندورة؟\n- ما هو الشيء الذي يخرج من الدجاجة ويأكله الناس؟\n- ما هو الشيء الذي يغطي جسمك عندما تنام في الليل؟"
      },
      {
        number: 43,
        text: "يجيب عن أسئلة تتعلق بأحداث افتراضية",
        instruction: "التعليمات:\nتمرين: ماذا تفعل إذا لم تستطع إيجاد حذائك في الصباح؟\n\n- ماذا تفعل إذا شعرت بالمرض؟\n- ماذا تفعل إذا سقطت؟\n- ماذا تفعل إذا أردت اللعب بلعبة صديقك؟\n\nالتقييم: إجابتان صحيحتان\n\nإضافي:\n- ماذا تفعل إذا جعت؟\n- ماذا تفعل إذا انكسرت لعبتك؟\n- ماذا تفعل إذا عطشت؟"
      },
      {
        number: 44,
        text: "يسمي فئات المفاهيم",
        instruction: "التعليمات:\nتمرين: استمع، كلب، قط، حصان، بقرة، ماعز. كل هذه حيوانات.\n\n- خبز، فاصوليا، تفاح، أرز. كل هذه...\n- ماء، حليب، عصير، صودا. كل هذه...\n- قميص، فستان، بنطلون، جوارب. كل هذه...\n\nالتقييم: إجابتان صحيحتان\n\nإضافي:\n- تفاح، موز، عنب، برتقال. كل هذه...\n- جزر، خيار، طماطم، بطاطس. كل هذه...\n- عصفور، بطة، نسر، حمامة. كل هذه...\n- كرة، دمية، مكعبات، سيارة لعبة. كل هذه...\n- أحمر، أزرق، أصفر، أخضر. كل هذه...\n- قطة، كلب، أرنب، هرة. كل هذه..."
      }
    ]
  },
   {
    label: "العمر 5:6-5:11",
    items: [
      {
        number: 45,
        text: "يجيب على أسئلة 'لماذا' بتقديم سبب",
        instruction: "التعليمات:\nتمرين: لماذا نلبس الأحذية؟\n- لماذا ننام؟\n- لماذا نأكل؟\n- لماذا نغسل أيدينا؟\n\nالتقييم: إجابتان صحيحتان"
      },
      {
        number: 46,
        text: "تكرار الجمل",
        instruction: "التعليمات:\nتمرين: أنا أحب الشوكولاتة.\n- \هل تعطيني شيئًا لأشرب؟\n- الطفلة التي تغني هي أختي.\n- هل يمكن لأصدقائي القدوم لمشاهدة التلفاز؟\n- عندما عاد من المدرسة، أكل سامي تفاحة.\n\nالتقييم: إجابتان صحيحتان"
      }
    ]
  },
  {
    label: "العمر 6:0-6:11",
    items: [
      {
        number: 47,
        text: "يسرد القصة بتتابع منطقي",
        instruction: "التعليمات:\nتمرين:\n- كان هناك أخوان يلعبان كرة السلة، وقال الأخ الأكبر: أنت لن تسجل أي سلة أبدًا!\n- أخذ الأخ الأصغر الكرة ورمى بها عالياً قدر استطاعته.\n- أوه! تعثر الأخ الأصغر وسقط، ولكن الكرة رغم ذلك دخلت السلة.\n\nالتقييم:\nيصف الطفل جميع الصور بتتابع منطقي.\n\nملاحظة:\nالتسلسل الصحيح للقصة هو ١-٢-٣-٤ أو ١-٣-٢-٤.\nلا يشترط أن يكون وصف كل صورة بجملة كاملة أو صحيحة نحويًا للحصول على النقاط عن التسلسل."
      },
      {
        number: 48,
        text: "يسرد القصة باستخدام جمل صحيحة نحويًا",
        instruction: "التعليمات:\nتمرين:\nولد ضاع دبه، احكِ لي القصة.\n- كان يبحث عن دبه.\n- \"ماما، هل تعرفين أين دبي؟\"\n- وكان يبحث عن الدب في كل مكان.\n- ماما وجدت الدب.\n\nالتقييم:\nيستخدم الطفل ثلاث جمل صحيحة نحويًا أو أكثر تصف الأفعال في الصور.\n\nملاحظة:\nيجب أن تكون كل جملة صحيحة نحويًا ومتوافقة مع الفعل الظاهر في الصورة.\nعند سرد الطفل للقصة، يجب أن تتضمن جملته إشارات على الأقل للصورة الأولى."
      },
      {
        number: 49,
        text: "يصحح السخافة اللغوية الدلالية",
        instruction: "التعليمات:\nتمرين: سأقول لك شيئًا لا معنى له. أريدك أن تغيّره ليصبح ذا معنى.\n\nأمثلة:\n- انت ولد؟ (إذا كانت بنت)\n- موزة لونها أحمر؟\n- القطة بتعمل عوو؟\n- الولد أكل سيارة كبيرة.\n- الفتاة تأكل معكرونة بحذاء.\n- الولد ينام على دراجة هوائية.\n\nملاحظة:\nلا يشترط أن يكون الرد صحيحًا نحويًا شرط أن يكون البناء الجديد مناسبًا دلاليًا.\n\nالتقييم:\nإجابتان صحيحتان"
      },
      {
        number: 50,
        text: "يعيد سرد قصة مع مقدمة",
        instruction: "التعليمات:\nيجب أن تتضمن المقدمة معلومات من الجزء الأول من القصة (أي شخصيات القصة: طفلان وكلب).\n\nأمثلة:\n- الطفلان لديهما كلب اسمه لولو.\n- أحمد ومايا شافوا لولو برا تحت المطر.\n- الكلب يحتاج إلى منزل.\n- لولو تبلل بالكامل تحت المطر.\n- الطفلان سيصنعان منزلًا.\n\nالتقييم:\nالطفل يقدم القصة/الشخصيات (بما في ذلك الكلب والأطفال) من الجزء الأول من القصة."
      },
      {
        number: 51,
        text: "يعيد سرد قصة بأربعة أحداث متسلسلة",
        instruction: "التعليمات:\nيصف الطفل أربعة أحداث على الأقل من القصة بترتيب صحيح.\nينبغي أن يستخدم الطفل كلمات مثل: \"ثم\"، \"بعد ذلك\"، \"لذا\".\n\nملاحظة:\nلا يكفي أن يكتفي الطفل بتسمية الفعل في كل صورة فقط.\n\nالتقييم:\nأربعة أحداث صحيحة ومتسلسلة"
      },
      {
        number: 52,
        text: "يعيد سرد قصة بخاتمة منطقية",
        instruction: "التعليمات:\nيجب أن يضمن الطفل خاتمة واضحة ومنطقية تتضمن معلومات من الجزء الثامن من القصة، تشير إلى أن لولو\nالكلب سعيد لأنه دافئ وجاف أو بأمان بعيدًا عن المطر وفي بيته الآمن.\n\nأمثلة:\n- الآن عندما تمطر، لا يبتل لولو.\n- لولو جاف ودافئ عندما تمطر الآن.\n- النهاية.\n- لولو سعيد.\n- لولو نائم في منزله الصغير.\n\nالتقييم:\nيجب أن تتضمن إعادة السرد خاتمة منطقية تشمل معلومات من الجزء الثامن من القصة.\nلا يكتفى بوصف الفعل الأخير فقط دون تعليقات ختامية."
      },
      {
        number: 53,
        text: "يكمل أوجه الشبه",
        instruction: "التعليمات:\nتمرين: فكّر في شيءٍ شديد السخونة.\n(الشمس / النار / الشمعة)\n\n- إذا كان شيء ما شديد البرودة، بارد: ______\n- إذا كان شيء ما حادًا جدًا: ______\n- إذا كان شيء ما أخضر جدًا: ______\n\nالتقييم:\nيجب أن يكون هناك إجابتان صحيحتان على الأقل.\n\nإضافي:\n- إذا كان شيء ما كبيرًا جدًا: ______\n- إذا كان شيء ما سريعًا جدًا: ______\n- إذا كان شيء ما لينًا جدًا: ______"
      }
    ]
  },
  {
    label: "العمر 7:0 - 7:11",
    items: [
      {
        number: 54,
        text: "يصف أوجه التشابه",
        instruction: "التعليمات:\nتمرين: سنتحدث عن شيئين وكيف يشبهان بعضهما البعض.\nمثال: الملعقة والشوكة متشابهان لأننا نأكل بهما.\nاستخدم التلميحات حسب الحاجة فقط.\n\nأسئلة التمرين:\n- كيف يشبه الطائرة والطيور بعضهما البعض؟\n- كيف يشبه الشمس والقمر بعضهما البعض؟\n- كيف يشبه الحجر والطوبة بعضهما البعض؟\n- كيف يشبه الحليب والعصير بعضهما البعض؟\n\nالتقييم:\nثلاث إجابات صحيحة\n\nملاحظة:\nلا يجب أن تكون الإجابة جملة كاملة أو صحيحة نحويًا للحصول على درجة صحيحة."
      },
      {
        number: 55,
        text: "استخدام صيغة المضارع المنصوب",
        instruction: "التعليمات:\nتمرين: الآن سنتحدث عن هذه الرسوم. سأبدأ وأنت تكمل.\n\n- الطفل لا يريد أن يأكل. أمه تريد منه أن... (توقف لانتظار الإجابة)\n- هي لا ترغب في القفز. لا أعتقد أن...\n- الطفل الطويل يصل إلى التفاحة. لا أعتقد أن هذا الطفل...\n- هذا الطفل يرسم. ليس لديه ورقة. لا أعتقد أنه...\n- هذه الفتاة بحاجة إلى مساعدة. تريد من أمها أن...\n\nالتقييم:\nثلاث إجابات صحيحة\n\nملاحظة:\nإذا تضمن رد الطفل فعلًا مختلفًا ولكن استخدم صيغة المضارع المنصوب بشكل صحيح وكان منطقيًا في السياق، اعتبره صحيحًا.\n\nمعلومات إضافية:\nغالبًا نستخدم كلمات مثل:\n- أن = أريد أن ألعبَ (بدي العب)\n- لِـ = درست لأنجح\n- حتى = تعبت حتى وصلت\n- لن = لن أذهب غدًا\n- إذن = إذن لنبدأ اللعب"
      },
      {
        number: 56,
        text: "صياغة الجمل",
        instruction: "التعليمات:\nتدريب 1:\n- دوري: \"سأكوّن جملة باستخدام كلمتي 'قطة' و'فأر'\" → \"القطة تركض وراء الفأر\"\n- دورك: \"الآن كوّن جملة باستخدام كلمتي 'كلب' و'قطة'\"\n\nتدريب 2:\n- دوري: \"سأكوّن جملة باستخدام الكلمات الثلاث: 'مثلجات'، 'صغير'، و'أخ'\" → \"أخي الصغير أكل مثلجات\"\n- دورك: \"الآن كوّن جملة باستخدام الكلمات: 'بسكويت'، 'أخوات'، و'كتير'\"\n\nأمثلة إضافية:\n- ولد، بسكليت\n- المدرسة، الولد، متأخر\n- بنت، ما، شافت\n\nالتقييم:\nإجابتان صحيحتان\n\nإضافي:\n- ولد، يشتري\n- ماما، سوق، فواكه\n- ولاد، شمس، بحر\n\nملاحظة:\nيجب أن تكون الجملة صحيحة من حيث المعنى والقواعد وتحتوي على جميع الكلمات المستهدفة."
      },
      {
        number: 57,
        text: "استخدام المرادفات",
        instruction: "التعليمات:\nتدريب: \"انظر إلى هذا الفيل. الفيلة حيوانات كبيرة. ما كلمة أخرى تعني كبيرة؟\" (ضخم، عملاق، هائل)\n\nأمثلة:\n- ولد غاضب\n- أعطيت أمي زهرة جميلة\n- كان علي يبدو غير سعيد\n- كان اللغز بسيط\n\nالتقييم:\nثلاث إجابات صحيحة\n\nملاحظة:\nلا يلزم أن تكون الإجابات صحيحة نحويًا (مثل توافق الصفة مع الاسم) لمنح الدرجة.\n\nإضافي:\n- سلحفاة تمشي ببطء\n- ولد ذكي\n- بنت فرحانة"
      },
      {
        number: 58,
        text: "يستخدم مفاهيم كمية (فارغ، أكثر)",
        instruction: "التعليمات:\nتمرين: أصغر من / أكبر من\n- أكثر من / أقل من\n- أطول من / أقصر من\n\nالتقييم:\nإجابتان صحيحتان"
      },
      {
        number: 59,
        text: "حذف الأصوات (الإسقاط)",
        instruction: "التعليمات:\nعرّف الطفل بكيفية نطق الكلمة عند حذف صوت معين منها.\n\nالإجراء:\n- انطق كلمة محددة\n- اطلب من الطفل حذف صوت حرف معين منها\n- ينطق الكلمة الجديدة بعد الحذف\n\nتدريب:\n1. كلب → لب\n2. صبح → صح\n3. تمر → تم\n\nأمثلة إضافية:\n- باب → اب\n- بحر → بر\n- شمع → شم\n\nالتقييم:\nإجابتان صحيحتان"
      },
      {
        number: 60,
        text: "إيجاد كلمات تتناغم",
        instruction: "التعليمات:\nعرّف الطفل بمفهوم القافية (كلمات تنتهي بنفس الصوت)\n\nأمثلة:\n- قرد / فرد / ورد / برد / نرد\n- شم (سم، عم، فم، دم)\n- قلب (لعب، كلب، حلب، صلب)\n- تمر (نمر، زمر، حمر، جمر)\n\nالتقييم:\nإجابتان صحيحتان"
      },
      {
        number: 61,
        text: "استخدام مفاهيم الزمن والتسلسل (متأخر، قبل)",
        instruction: "التعليمات:\nابدأ جملة واطلب من الطفل إكمالها.\nأشر إلى الجزء المناسب في كل صورة أثناء وصفك.\n\n- وصل هذا الولد إلى المدرسة مبكرًا. وصل هذا الولد إلى المدرسة... (متأخرًا، لاحقًا)\n- فرشت الفتاتان أسنانهما في الصباح. فرشت هذه الفتاة أسنانها بعد أن ارتدت ملابسها للمدرسة، ولكن هذه الفتاة فرشت أسنانها... (قبل)\n\nالتقييم:\nإجابتان صحيحتان"
      }
    ]
  },
];

const responses = {};
const showInstructions = {};
const showImages = {};
const hideImageButtonFor = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,28,29,41,42,43,44,45,46,49,53,54,55,56,59,60];

const container = document.getElementById("skills-container");

function renderSkills() {
  container.innerHTML = "";

  skillGroups.forEach((group) => {
    const groupCard = document.createElement("div");
    groupCard.className = "group-card";

    const groupHeader = document.createElement("h3");
    groupHeader.className = "group-header";
    groupHeader.textContent = group.label;
    groupCard.appendChild(groupHeader);

    group.items.forEach((item) => {
      const skillItem = document.createElement("div");
      skillItem.className = "skill-item";

      const skillMain = document.createElement("div");
      skillMain.className = "skill-main";

      const skillControls = document.createElement("div");
      skillControls.className = "skill-controls";

      // نص المهارة
      const skillHeader = document.createElement("p");
      skillHeader.textContent = `${item.number}. ${item.text}`;
      skillHeader.className = "skill-text";
      skillMain.appendChild(skillHeader);

      // عرض التعليمات
      if (showInstructions[item.number]) {
        const instrText = document.createElement("pre");
        instrText.className = "instructions-text";
        instrText.textContent = item.instruction;
        skillMain.appendChild(instrText);
      }

      // زر تعليمات
      const instrBtn = document.createElement("button");
      instrBtn.className = "instructions-btn";
      instrBtn.textContent = showInstructions[item.number] ? "إخفاء التعليمات" : "تعليمات";
      instrBtn.addEventListener("click", () => {
        showInstructions[item.number] = !showInstructions[item.number];
        renderSkills();
      });

      // أزرار الاختيار (يوجد، لايوجد، غير محدد)
      const answerButtonsDiv = document.createElement("div");
      answerButtonsDiv.className = "answer-buttons";

      ["يوجد", "لايوجد", "غير محدد"].forEach((option) => {
        const btn = document.createElement("button");
        btn.type = "button";
        btn.className = "answer-button";
        if (responses[item.number] === option) {
          btn.classList.add("selected");
        }
        btn.textContent = option;
        btn.addEventListener("click", () => {
          responses[item.number] = option;
          renderSkills();
        });
        answerButtonsDiv.appendChild(btn);
      });

       // زر عرض/إخفاء الصورة (إذا لم يكن ضمن المهارات المخفية)
       let imageBtn = null;
       if (!hideImageButtonFor.includes(item.number)) {
         imageBtn = document.createElement("button");
         imageBtn.type = "button";
         imageBtn.className = "instructions-btn";
         imageBtn.style.marginTop = "5px";
         imageBtn.textContent = showImages[item.number] ? "إخفاء الصورة" : "عرض صورة";
         imageBtn.addEventListener("click", () => {
           showImages[item.number] = !showImages[item.number];
           renderSkills();
         });
       }
      // زر الملاحظة
      const noteBtn = document.createElement("button");
      noteBtn.type = "button";
      noteBtn.textContent = "ملاحظة";
      noteBtn.className = "note-button";

          // إنشاء حاوية الأزرار اليسارية
       const controlButtonsLeft = document.createElement("div");
       controlButtonsLeft.className = "control-buttons-left";

       // إضافة الأزرار إلى الحاوية بالترتيب: تعليمات، عرض صورة، ملاحظة
       controlButtonsLeft.appendChild(instrBtn);
       if (imageBtn) controlButtonsLeft.appendChild(imageBtn); // الصورة فوق
       controlButtonsLeft.appendChild(noteBtn);                // الملاحظة تحت


      // مربع النص الخاص بالملاحظة (مخفي افتراضياً)
      const noteInput = document.createElement("textarea");
      noteInput.className = "note-input";
      noteInput.placeholder = "أدخل ملاحظة...";
      noteInput.style.display = "none";

      noteBtn.addEventListener("click", () => {
        noteInput.style.display = noteInput.style.display === "none" ? "block" : "none";
      });

      // تجميع الأزرار في القسم الخاص بها
      skillControls.appendChild(instrBtn);
      skillControls.appendChild(answerButtonsDiv);
      if (imageBtn) skillControls.appendChild(imageBtn);
      skillControls.appendChild(noteBtn);

      skillItem.appendChild(skillMain);
      skillItem.appendChild(skillControls);
      skillItem.appendChild(noteInput);

      // عرض الصورة إن تم تفعيلها
      if (showImages[item.number]) {
        const img = document.createElement("img");
        img.src = `images/skill${item.number}.png`; // تأكد من وجود الصور في هذا المسار
        img.alt = `صورة مهارة رقم ${item.number}`;
        img.className = "skill-image";
        skillItem.appendChild(img);
      }

      groupCard.appendChild(skillItem);
    });

    container.appendChild(groupCard);
  });
}

document.addEventListener("DOMContentLoaded", () => {
  renderSkills();
});

document.getElementById("export-btn").addEventListener("click", () => {
  const childName = document.getElementById("childName").value.trim();
  const parentName = document.getElementById("parentName").value.trim();
  const dob = document.getElementById("dob").value;
  const surveyDate = document.getElementById("surveyDate").value;
  const therapistInput = document.getElementById("therapistName");
  const therapistName = therapistInput ? therapistInput.value.trim() : "";

  const groupedAnswers = {
    يوجد: [],
    لايوجد: [],
    "غير محدد": [],
  };

  skillGroups.forEach(group => {
    group.items.forEach(item => {
      const answer = responses[item.number];
      const skillElements = [...document.querySelectorAll(".skill-item")];
      const skillElement = skillElements.find(el => el.querySelector(".skill-text").textContent.startsWith(item.number + "."));
      const noteInput = skillElement ? skillElement.querySelector(".note-input") : null;
      const noteText = noteInput ? noteInput.value.trim() : "";

      if (answer) {
        if (noteText) {
          groupedAnswers[answer].push(`${item.number}. ${item.text}\nملاحظة: ${noteText}`);
        } else {
          groupedAnswers[answer].push(`${item.number}. ${item.text}`);
        }
      }
    });
  });

  let reportText = `===============================\n`;
  reportText += `مهارات التواصل \n`;
  reportText += `===============================\n\n`;
  reportText += `اسم الطفل: ${childName}\n`;
  reportText += `اسم ولي الأمر: ${parentName}\n`;
  reportText += `تاريخ الميلاد: ${dob}\n`;
  reportText += `تاريخ التقرير: ${surveyDate}\n\n`;
  reportText += `اسم الاختصاصي: ${therapistName}\n\n`;

  Object.entries(groupedAnswers).forEach(([key, items]) => {
    if (items.length > 0) {
      reportText += `${key}:\n`;
      items.forEach(text => {
        reportText += `${text}\n`;
      });
      reportText += `\n`;
    }
  });

  const reportWindow = window.open("", "_blank", "width=700,height=700,scrollbars=yes,resizable=yes");
  if (!reportWindow) {
    alert("يرجى السماح للنوافذ المنبثقة في المتصفح لعرض التقرير.");
    return;
  }

  const escapedReport = reportText.replace(/</g, "&lt;").replace(/>/g, "&gt;");

  reportWindow.document.write(`
    <html lang="ar" dir="rtl">
      <head>
        <title>مهارات التواصل التعبيري - تقرير</title>
        <style>
          body { font-family: "Noto Sans Arabic", sans-serif; margin: 20px; background: #f9f9f9; }
          pre { white-space: pre-wrap; word-wrap: break-word; background: #fff; border: 1px solid #ccc; padding: 15px; font-size: 16px; }
          button { margin-top: 15px; padding: 10px 15px; font-size: 16px; cursor: pointer; }
        </style>
      </head>
      <body>
        <h1>مهارات التعبير التعبيري  - تقرير</h1>
        <pre id="report-text">${escapedReport}</pre>
        <button id="download-btn">تحميل التقرير</button>
        <script>
          document.getElementById("download-btn").addEventListener("click", () => {
            const text = document.getElementById("report-text").textContent;
            const blob = new Blob([text], { type: "text/plain;charset=utf-8" });
            const link = document.createElement("a");
            link.href = URL.createObjectURL(blob);
            link.download = "تقرير_مهارات_التعبير_${childName || "child"}.txt";
            document.body.appendChild(link);
            link.click();
            document.body.removeChild(link);
          });
        <\/script>
      </body>
    </html>
  `);

  reportWindow.document.close();
});
